sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
#include "esp32_pir_tg_bot.h"
/*		INIT	*/
extern "C" void app_main() {
	main_init();//nvs_func();
	dWrite(PIN_LINE, 1);pinMode(PIN_LINE, PULLUP | OUTPUT_OPEN_DRAIN);//dWrite(PIN_PULLUP, 1); pinMode(PIN_PULLUP, OUTPUT); 
	AutoLed<PIN_LED> led; pinMode(PIN_LED,OUTPUT);
	QueueMsgHandle = xQueueCreateStatic(QUEUE_LEN, QUEUE_ITEM_SIZE, QueueMsgStorage, &xStaticQueue);
	loopTaskHandle = xTaskCreateStatic(mainTask, "main", sizeof(xMainStack), NULL, 9, xMainStack, &xMainTaskBuffer);
	vTaskSuspend(loopTaskHandle); //vTaskPrioritySet(NULL, 12);
	sendTaskHandle = xTaskCreateStatic(sendTask, "send", sizeof(xSendStack), NULL, 11, xSendStack, &xSendTaskBuffer);
#ifdef CONFIG_GENERIC_LINE
	adcReadTaskHandle = xTaskCreateStatic(adcReadTask, "adc", sizeof(xAdcReadStack), NULL, 2, xAdcReadStack, &xAdcReadBuffer);
	gpio_config_t conf = { BIT(PIN_ADC_LINE) | BIT(PIN_ADC_PULLUP), GPIO_MODE_INPUT, GPIO_PULLUP_ENABLE };
    gpio_config(&conf);
#endif
	nvs_read_sets();
	init_sets();
	sets.alarm ? alarm_on(false) : alarm_off(false);
	SPIFFS.begin();
	read_credentials();
#ifndef FIRST_BUILD
	assert(timer_pwr = esp_timer_init([](void* ) { dWrite(PIN_PWR_BUTTON, 1); } )); 
	pinMode(PIN_LED_D5, PULLUP | OUTPUT); pinMode(PIN_BUTTON, INPUT);//pinMode(PIN_RELAY, OUTPUT);
	dWrite(PIN_PWR_BUTTON, 1); pinMode(PIN_PWR_BUTTON, OUTPUT_OPEN_DRAIN);
#ifdef RELAY
	dWrite(PIN_RELAY, RELAY_STATE(sets.relay)); pinMode(PIN_RELAY, OUTPUT);
#endif
	WiFi.mode(WIFI_MODE_STA);
#else
	wifi_ap_init();
#endif
	wifi_server_init();
	if (!wifi_sta_init()) { /*WiFi.begin(DEFAULT_SSID, DEFAULT_PASS);*/ /* if (!wifi_sta_init()) wifi_ap_init(); */ };
	configTzTime("MSK-3", "pool.ntp.org", "time.nist.gov"); 
	time_sync();//setenv("TZ", "MSK-3", 1); tzset();
	bot.attachUpdate(updateHandler);
	bot.skipUpdates(-2);
	bot.setPollMode(fb::Poll::Long, 30000);
	botSend.client.setHandshakeTimeout(5); bot.client.setHandshakeTimeout(15);
	send_alarm_time(Message("", CHAT_ID), bot, false);
	bot.sendMessage(Message(get_info(true), CHAT_ID));
	log_d("StackHighWaterMark: %u", uxTaskGetStackHighWaterMark2(NULL));
	vTaskResume(loopTaskHandle);
}

void mainTask(void*) {
	for (TickType_t lastTry = 0;; /* led_blink() */ ) {//CHANGED
		switch (Flag) {
		case RESEND_MSG: 
		if (xTaskGetTickCount() - lastTry > pdMS_TO_TICKS(15 * 60 * 1000)) {
			if(send_alarm_time()) Flag = CHECK_MSG; lastTry = xTaskGetTickCount(); log_i("%u", Flag);
		}
		case CHECK_MSG: 
			{ AutoLed <PIN_LED_D5> led;
			if (wifi_sta_init()) { delay(10); bot.tick(); } } 
			delay(FB_LONG_POLL_TOUT);	continue;
		case WIFI_DISCONNECT: time_sync(); WiFi.disconnect();
			ulTaskNotifyTake(pdFALSE, pdMS_TO_TICKS(60 * 60 * 1000));
		case WIFI_RECON: 
			if (wifi_sta_init()) { bot.tickManual(); } continue;
		case WIFI_INIT: WiFi.begin(Auth->ssid, Auth->pass);
			delete Auth; Auth = nullptr;
			Flag = CHECK_MSG; continue;
		case RESTART: bot.tickManual(); esp_restart(); return;
		default: vTaskDelay(1);  ESP_LOGI("main",""); Flag = CHECK_MSG;
		}
	}
}

void sendTask(void*) {
	Message msg("", CHAT_ID); tgMsg_t event;
	for (TickType_t tick = 0;;) {
		if (xQueueReceive(QueueMsgHandle, &event, portMAX_DELAY) == pdPASS) {
			AutoLed<PIN_LED> led; 
			if (wifi_sta_init()) {
				switch (event.status) {
				case ALARM: msg.text = "ALARM"; break;
				case DOOR_CLOSE:  msg.text = "DOOR_CLOSE";  break;
				case DOOR_OPEN:  msg.text = "DOOR_OPEN";  break;
				case LINE_LOW:  msg.text = "LINE_LOW";  break;
				case LINE_HIGH: msg.text = "LINE_HIGH"; break;
				case ok: msg.text = "OK";
					if(event.counter) { CHECK_(timer_alarm(timer_sab, TIMER_SABOTAGE)); }
					//goto _OK;
				default: break;
				}
				msg.text.concat('\t'); msg.text.concat(event.delta);
				//_OK: //if (event.counter > 1) { msg.text.concat("\t%\t"); msg.text.concat(event.counter); }
				vTaskDelayUntil(&tick, pdMS_TO_TICKS(1000)); tick = xTaskGetTickCount();
				log_i("%s", msg.text.c_str()); //if(!dRead(PIN_BUTTON)) goto save;
				if (botSend.sendMessage(msg)) {
					if(Flag > CHECK_MSG) resumeTask(); log_v(""); 
					continue;
				}
				else {
					log_w("try again"); delay(2000);
					if (botSend.sendMessage(msg)) { tick = xTaskGetTickCount(); continue; }
				} log_d("%u", ESP.getFreeHeap());
			}
			else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected);
save:		if (event.status != ok) { log_i("save");
				appendFile(ALARM_PATH, timestamp_unix + ((uS - time_sync_unix) / 1000000));
				if(Flag != RESEND_MSG) resumeTask(RESEND_MSG); 
			}
		}//vTaskGetInfo();
	}
}

void adcReadTask(void*) { 
	adc_digi_output_data_t *p; tgMsg_t out {};
	for(uint32_t val, ret_num;;) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        //TickType_t now =  xTaskGetTickCount(); ESP_LOGD("TIME", "%lu", pdTICKS_TO_MS(now - last)); last = now;
            esp_err_t ret = adc_continuous_read(adc_handle, adc_buf, BUF_ADC_SIZE, &ret_num, 0);
            if (ret == ESP_OK)  {
                //ESP_LOGW("TASK", "ret = %x, ret_num = %"PRIu32" bytes", ret, ret_num);
                ret_num /= SOC_ADC_DIGI_RESULT_BYTES;
                for (int i = 0, val = 0; i < ret_num; i++) { 
                    p = &reinterpret_cast<decltype(p)>(adc_buf)[i];// __unused uint32_t chan_num = EXAMPLE_ADC_GET_CHANNEL(p);
                    val += ADC_GET_DATA(p);
                }
                val /= SAMPLE_BUF;
				{
				if(val > gerkon_open_high) { if(out.status == LINE_HIGH) { continue; } out.status = LINE_HIGH; }
				else if(val > gerkon_close_high) { 
					if(!sets.alarm || out.status == DOOR_OPEN) { continue; } out.status = DOOR_OPEN; }
				else if(val > gerkon_close_low ) { 
					if(!sets.alarm || out.status == DOOR_CLOSE) { continue; } out.status = DOOR_CLOSE; }
				else if(val > adc_button_low) {
					//if(++out.counter == ADC_TASK_FREQ);
					const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
					dWrite(PIN_RELAY, new_state);
					out.status = RELAY_STATE(new_state) ? RELAY_1 : RELAY_0;
				}
				else if(out.status == LINE_LOW) { continue; } out.status = LINE_LOW; //val < adc_button_low
				}
				uint32_t volt = val * 3300 / 4095; 
				ESP_LOGI("adc", "Voltage: %lu\tValue: %lu", volt, val);
				out.counter = 0;
				out.delta = val;
				xQueueSend(QueueMsgHandle, &out, 0);
            }
            else if (ret == ESP_ERR_TIMEOUT) { /* ESP_LOGW("ERR", "TIMEOUT"); */ }
            else { ESP_LOGE("ERR", "err = 0x%02X", ret); }
	
    } //ESP_ERROR_CHECK(adc_continuous_stop(adc_handle)); ESP_ERROR_CHECK(adc_continuous_deinit(adc_handle));
}

bool conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data) {
    vTaskNotifyGiveFromISR(adcReadTaskHandle, NULL);
    return false;
}

