sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
void time_sync(byte wait_sec) {
	DEBUG("Time sync "); if (!WiFi.isConnected()) return;
	time_t temp = 0;
	for (;; --wait_sec) {
		time(&temp);
		if (temp > 0x40000000) break;
		if (wait_sec == 0) {
			DEBUGLN(" failed!"); return;
		}
		delay(1000); DEBUG('*');
	}
	time_sync_unix = uS; DEBUGLN(" success");
	timestamp_unix = temp;
	log_i("%u , timer %u", temp, wait_sec);
}
/*		INTERRUPTS		*/
static void isr_handler(/*void**/) {
	if (lineRead) return;
	uint64_t time = uS;
	timer_restart_impl();
	tgMsg_t tmp; uint32_t delta = time - last_interrupt; 
	last_interrupt = time; //interrupt_delta = delta; 
	if (delta < 2400000 /*&& delta > 10000*/) {
		if (delta < 10000) { disableInterrupt(PIN_LINE); esp_timer_start_once(timer_intr, 1000 * 300); } 
		tmp.status = ALARM; tmp.delta = (uint16_t)(delta / 1000);
	}
	else if (last_state == ok) return;
	else { tmp.status = ok; tmp.counter = (last_state > LINE_LOW) ? 1 : 0;
	} //isr_log_d("%u", tmp.status);
	last_state = tmp.status; 
	xQueueSendFromISR(QueueMsgHandle, &tmp, NULL);//sizeof(tgMsg_t)
}

static bool sabotage_timer(gptimer_handle_t tmr, const gptimer_alarm_event_data_t* edata, void* user_ctx) {
	uint32_t delta = edata->count_value / 1000;
	tgMsg_t tmp {
		.status = lineRead ? LINE_HIGH : LINE_LOW,
		.delta = (uint16_t)(delta > __UINT16_MAX__ ? __UINT16_MAX__ : delta)
	};
	last_state = tmp.status;
	xQueueSendFromISR(QueueMsgHandle, &tmp, nullptr);
	return false;
}

/*		FILE SYSTEM	*/
bool send_alarm_time(Message&& msg, FastBot2& _bot, bool no_file) {
	DEBUG("Reading file: "); DEBUG(ALARM_PATH); //sizeof(Message);108
	String& str = msg.text; File file = SPIFFS.open(ALARM_PATH, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		if (no_file) { str = "No file"; _bot.sendMessage(msg); }
		return true;
	}
	const uint32_t file_size = file.size(), count = file_size / sizeof(time_t), str_len = 18 * count, heap = ESP.getFreeHeap();
	__unused char* ptr; size_t offset; time_t timestamp = 0; tm * timeinfo; int tm_yday_last = 0;
	log_i("file_size %u, count %u, str_len %u, HEAP %u", file_size, count, str_len, heap);
	if (!str.reserve(str_len) /*|| heap - 5000 < str_len*/) {
		str += "file_size \n"; str += file_size; str += "count \n";
		str += count; str += "str_len \n"; str += str_len; str += "HEAP \n"; str += heap;
		goto try_send;
	}ptr = str.begin();
	for (offset = 0; offset < str_len && file.available();) {
		file.read((byte*)&timestamp, sizeof(time_t)); DEBUG(timestamp); DEBUG(' ');//"%H:%M:%S %d.%m.%y"
		timeinfo = localtime(&timestamp);  //localtime_r() do same
		strftime(&ptr[offset], 9, "%H:%M:%S", timeinfo);
		offset += 8;
		if (timeinfo->tm_yday != tm_yday_last) {
			strftime(&ptr[offset], 10, " %d.%m.%y", timeinfo);
			offset += 9;
			tm_yday_last = timeinfo->tm_yday;
		}
		ptr[offset++] = '\n'; //free(timeinfo);
		//str += (uint32_t)timestamp; str += "\n";
	}DEBUGLN(); //log_d("%u", ESP.getFreeHeap());
	ptr[offset - 1] = '\0';
	reinterpret_cast<uint32_t*>(&str)[2] = offset; //incapsulation hack //_ptr.len
try_send: DEBUGLN(str);
	if (wifi_sta_init()) {
		if (_bot.sendMessage(msg)) {
			if (event_id) { WiFi.removeEvent(event_id); event_id = 0; }
		}
		return true;
	}
	else if (!event_id) event_id = WiFi.onEvent(onWiFiConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
	return false;

}

bool readFile(cch* path, String& Content) {
	DEBUG("Reading file: "); DEBUGLN(path);
	fs::File file = SPIFFS.open(path, FILE_READ);
	if (!file || file.isDirectory() || !file.available()) {
		DEBUGLN(" failed to open file for reading");
		return false;
	}
	Content = file.readStringUntil('\0');
	return true;
}

bool writeFile(cch* path, const String& Content) {
	DEBUG("Writing file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_WRITE);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.print(Content)) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool appendFile(cch* path, time_t value) {
	DEBUG("Append file: "); DEBUG(path);
	fs::File file = SPIFFS.open(path, FILE_APPEND);
	if (!file) { DEBUGLN(" failed to open file for writing"); }
	else if (file.write((byte*)&value, sizeof(time_t))) {
		DEBUGLN(" written");
		return true;
	}
	else {DEBUGLN(" write failed");}
	return false;
}

bool deleteFile(cch* path) {
	DEBUG("Deleting file: "); DEBUG(path);
	if (!SPIFFS.remove(path)) {
		DEBUGLN(" delete failed");
		return false;
	}
	DEBUGLN(" deleted");
	return true;
}
/*		WIFI	*/
bool wifi_sta_init(uint32_t time) {
	if (WiFi.isConnected() == false) {
		if (!WiFi.STA.begin(true)) return false; wl_status_t status; log_i("Wait connection %u sec", time);
		for (; (status = WiFi.status()) != WL_CONNECTED; time--) {
			if (time == 0) { log_w("Not connected"); return false; }
			delay(STA_INIT_DELAY); DEBUG(status); DEBUG(' ');
		} DEBUGLN(status); log_d("%u", time);
	}
	return true;
}

void wifi_ap_init() {
	WiFi.mode(WIFI_MODE_APSTA);
#if	AP_WIFI_CHANNEL > 11
	CHECK_(esp_wifi_set_country_code("CN", false));
#endif
	WiFi.softAP(AP_SSID, AP_PASS, AP_WIFI_CHANNEL, SSID_HIDDEN);
	WiFi.setTxPower(WIFI_POWER_20dBm); DEBUGLN(WiFi.getTxPower()); //WIFI_POWER_20dBm = 80,// 20dBm
	WiFi.softAPbandwidth(WIFI_BW_HT20);
	DEBUGLN("\nAP running"); DEBUGLN(AP_SSID); DEBUGLN(AP_PASS); DEBUG("My IP address: "); DEBUGLN(WiFi.softAPIP());DEBUGLN();
}

void wifi_server_init() {
	/* __weak_symbol  */extern AsyncWebServer server;
	server.onNotFound([](AsyncWebServerRequest* request) {
		DEBUGLN("[" + request->client()->remoteIP().toString() + "] HTTP GET request of " + request->url());
		request->send(404, "text/plain", "Not found");
		});
	server.on("/connect", HTTP_GET, [](AsyncWebServerRequest* request) { String str;
		if(Auth) { str = "Connecting to:\n"; str += "SSID = ["; str += (Auth->ssid); str += "]\n"; str += "PASS = ["; str += Auth->pass; str += "]\n";
			resumeTask(WIFI_INIT); }
		else { str = "Auth empty"; } 
		request->send(200, "text/plain", str); 
		});
	server.on("/disconnect", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Disconnecting..."); resumeTask(WIFI_DISCONNECT);
		});
	server.on("/restart", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Esp restarting...");
		resumeTask(RESTART);
		});
	server.on("/alarm_on", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm on"); alarm_on();
		});
	server.on("/alarm_off", HTTP_GET, [](AsyncWebServerRequest* request) {
		request->send(200, "text/plain", "Alarm off"); alarm_off();
		});
	server.on(CHANGE_AUTH, HTTP_GET, [](AsyncWebServerRequest* request) {
		auto response = request->beginResponse(SPIFFS, CHANGE_FAILE_PATH, "text/html");
		response->addHeader(asyncsrv::T_Content_Encoding, "gzip");
		request->send(response);
		});
	server.on(CHANGE_AUTH, HTTP_POST, onConfigRequest);
#if defined RELAY
	server.on(RELAY_ON, HTTP_GET, [](AsyncWebServerRequest* request) {
		const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
		dWrite(PIN_RELAY, new_state);
		request->send(200, "text/plain", RELAY_STATE(new_state) ? "RELAY ON" : "RELAY OFF");
		});
#endif
	ota::server_init(server
#ifdef DEBUG_ENABLE
		, ota_progress
#endif // DEBUG_ENABLE
	);
	server.begin(); log_v("server.begin()");
}

void onWiFiConnected(arduino_event_id_t event) {
	if (event == ARDUINO_EVENT_WIFI_STA_GOT_IP) {
		WiFi.removeEvent(event_id); event_id = 0; log_d("");
		resumeTask(RESEND_MSG);
	} else { log_d( "%u", event); }
}

void onConfigRequest(AsyncWebServerRequest* request) {
	auto pSSID = request->getParam(0), pPASS = request->getParam(1);
	bool wrongSSID = pSSID->value().length() == 0, wrongPASS = pPASS->value().length() < 8;
	if (wrongSSID || wrongPASS) {
		request->send(200, "text/plain", "WRONG INPUT"); return;
	}
	delete Auth;
	Auth = new auth_t{
		.ssid = pSSID->value(),
		.pass = pPASS->value()
	};//sizeof(auth_t)
	String log; log.reserve(128);
	//DEBUGF("POST[%s]: %s\n", pSSID->name().c_str(), pSSID->value().c_str(), pPASS->name().c_str(), pPASS->value().c_str());
	log += "SSID = ["; log += Auth->ssid; log += "]\n"; log += "PASS = ["; log += Auth->pass; log += "]\n";
	log += "Done. Go to ""/connect"; DEBUGLN(log);
	request->send(200, "text/plain", log);
	//resumeTask(WIFI_INIT);
}
/*		TELEGRAM	*/
void handleMessage(fb::Update& u) {
	Message msg("",u.message().chat().id()); DEBUGLN(u.message().text());
	switch (u.message().text().hash()) {
	case SH("/connect"):
		Flag = CHECK_MSG; msg.text = "Stay connected"; break;
	case SH("/disconnect"):
		Flag = WIFI_DISCONNECT; msg.text = "Disconnecting..."; break;
	case SH("/alarm"):
		alarm_on(); msg.text = "Alarm on"; break;
	case SH("/alarm0"):
		alarm_off(); msg.text = "Alarm off"; break;	
	case SH("/info"):
		msg.text = std::move(get_info()); break;
	case SH("/task_list"):
		get_task_list(msg.text); break;
	case SH("/restart"):
		bot.reboot(); Flag = RESTART; msg.text = "Restarting..."; break;
	case SH("/time_sync"):
		time_sync_unix = uS;
		timestamp_unix = u[tg_apih::date].toInt(); msg.text = "Done"; break;
	case SH("/send_alarm"):
		send_alarm_time(std::move(msg), bot); return;
	case SH("/clear_alarm"):
		msg.text = deleteFile(ALARM_PATH) ? "Done" : "No file"; break;
	case SH("/valid"):
		msg.text = (int)img_state(true); break;
	case SH("/invalid"): esp_ota_mark_app_invalid_rollback_and_reboot(); return;
	/* case SH("/pir_reset"):
		 pir_reset(); msg.text = "Done"; break; */
	case SH("/bot_kill"): {memset((void*)&bot, 0, sizeof(botSend)); } break;
	//case SH("/die"): Flag = PANIC; msg.text = "/die"; break;
		//case SH("/ota_invalidate"):
		//msg.text = (int)esp_ota_invalidate_inactive_ota_data_slot(); break;
		//case SH("/timer_count"): {uint64_t count = 0; gptimer_get_raw_count(timer_sab, &count);msg.text = String(count /= 1000); } break;
		//case SH("/nvs_erase"): nvs_wifi_erase(); break;
#if defined RELAY
	case SH(RELAY_ON): {
		const int new_state = !dRead(PIN_RELAY); sets.relay = RELAY_STATE(new_state);
		dWrite(PIN_RELAY, new_state); //msg.text = "RELAY ON"; 
	} break;
#endif
#ifndef FIRST_BUILD
	case SH("/pwr"):
	if(!esp_timer_start_once(timer_pwr, 100 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; } break;
	case SH("/pwr_push"):
	if(!esp_timer_start_once(timer_pwr, 10 * 1000 * 1000))
	{ dWrite(PIN_PWR_BUTTON, 0); msg.text = "pwr_btn"; msg.text += " push"; } break;
	case SH("/pwr_up"):
		dWrite(PIN_PWR_BUTTON, 1); msg.text = "pwr_btn"; msg.text += " release"; break;
#endif
#ifndef NO_BLE
	case SH("/ble_clear"):
		free(ble_data); ble_data = nullptr; ble_data_size = 0;
		msg.text = "Done"; break;
	case SH("/ble_deinit"): break;
	case SH("/ble"): {
		auto && ret = ble_advertising(ble_data, ble_data_size);
		if (ret == ESP_OK) msg.text = "BLE data sended";
		else if (ret == -1)  msg.text = "BLE data empty";
		else msg.text = String(ret, HEX);
	} break;
	default: {
		/* if (u.message().text().startsWith(BLE_SET)) {
			if (strtoB(u.message().text(), ble_data, ble_data_size, sizeof(BLE_SET))) {
				create_hex_string(msg.text, ble_data, ble_data_size);
			}
			else msg.text = "Wrong format";
		} 
		else if (u.message().text().startsWith(PIN_GEN)) {
			uint32_t pin = generate_pin(u.message().text().str() + sizeof(PIN_PASS_SET)//-1
			,u.message().text().length(), pin_pass);
			msg.text = pin;
		} 
		 else if (u.message().text().startsWith(PIN_PASS_SET)) {
			if(u.message().text().length() > sizeof(PIN_PASS_SET) + 42) { msg.text = "too much size";} 
			else {
				pin_pass = u.message().text().str() + sizeof(PIN_PASS_SET); //with space
				msg.text = "password changed to: ";  msg.text += pin_pass;//sizeof(Text) 
				msg.text += '\n'; msg.text += "pin_pass_len = "; msg.text += pin_pass.length();
			}
		} 
		else*/ { msg.text = "Unknown"; }
	}
#else 
	default:  if(u.message().text().startsWith("/mode_")) {
		cch* data = u.message().text()._str + sizeof("/mode_")-1;
		ESP_LOGI(TAG, data);
		byte proxima = 0xFF, adc = 0xFF;
		if(data[0] == '1') { proxima = 1;}
		else if(data[0] == '0') { proxima = 0; } 
		if(data[1] == '1') { adc = 1; }
		else if(data[1] == '0') { adc = 0; } 
		if(proxima == 0xFF || adc == 0xFF) {
			 msg.text = "WRONG INPUT\n"; break;
		} else  {
			msg.text = "Proxima "; msg.text += proxima ? "ON": "OFF";
			msg.text += "\nADC_Line "; msg.text += adc ? "ON": "OFF";
			sets.proxima = proxima, sets.adc_line = adc;
			init_sets();
		};
	} else { msg.text = "Unknown";} 
	}
#endif
	DEBUGLN(msg.text);
	bot.sendMessage(msg);
}

