sQueezy1332/esp32_proxima_pir_tgbot/main.cpp
void handleDocument(fb::Update& u) {
	switch (u.message()[tg_apih::caption].hash()) {
	case SH("/fw"): otaBegin(u, &Fetcher::updateFlash); break;
	case SH("/filesystem"): otaBegin(u, &Fetcher::updateFS); break;
	default: bot.sendMessage(Message("Unknown", u.message().chat().id()));
	}
}

void otaBegin(fb::Update& u, bool(Fetcher::* updater)()) {
	AutoLed<PIN_LED> led; //vTaskSuspend(sendTaskHandle);
	bool temp = sets.alarm; if(temp) alarm_off(false);
	auto ptr = esp_ota_get_next_update_partition(NULL);
	Message msg("OTA begin\nPartition: ", u.message().chat().id());
	msg.text += ptr->label; msg.text += "\nsize: "; msg.text += ptr->size;
	bot.sendMessage(msg);
	Fetcher fetch = bot.downloadFile(u.message().document().id());
	if (fetch) {
		if ((fetch.*updater)()) { msg.text = "Success\nRestarting..."; Flag = RESTART; }
		else { msg.text = "Error = "; msg.text += Update.getError();msg.text += '\n';
			msg.text += "esp_err = 0x"; msg.text += String(update_error, HEX); update_error = 0;} 
	}
	else { msg.text = "Download error"; }
	log_i("%s", msg.text.c_str());
	bot.sendMessage(msg);
	if(temp) alarm_on(false); vTaskResume(sendTaskHandle);
	log_d("StackHighWaterMark: %u", uxTaskGetStackHighWaterMark2(NULL));
}

void updateHandler(fb::Update& u) {
	if (u.isMessage() && u.message().from().id() == USER_ID) {
		if (Flag > CHECK_MSG) Flag = CHECK_MSG;
		if (u.message().hasDocument() && u.message().document().name().endsWith(".bin"))
			handleDocument(u);
		else handleMessage(u);
	}
}
/*		BLUETOOTH		*/
#ifndef NO_BLE
esp_err_t ble_advertising(cbyte* ble_data, cbyte ble_data_length, uint32_t time_ms) {
	if (ble_data == nullptr || ble_data_length == 0) return -1; log_d("%u", ESP.getFreeHeap());
	return ESP_OK;
}
#endif
/*		MISC		*/
void read_credentials() {
	wifi_config_t config {};  size_t ssid_l, pass_l;
	esp_wifi_get_config(WIFI_IF_STA, &config);log_d("%s\tpass: %s", config.sta.ssid,config.sta.password);
	ssid_l = strlen((char*)config.sta.ssid); pass_l = strlen((char*)config.sta.password);
	if (ssid_l < 1 || pass_l < 8) {
		log_w("ssid len %u, pass len %u", ssid_l, pass_l);
  		config.sta.threshold.rssi = -127;
		memcpy(config.sta.ssid, DEFAULT_SSID, sizeof(DEFAULT_SSID));
		memcpy(config.sta.password, DEFAULT_PASS, sizeof(DEFAULT_PASS));
		esp_wifi_set_config(WIFI_IF_STA, &config);
	}
}

void nvs_read_sets() {
	nvsApi nvs;
    if(nvs.begin(NVS_WIFI_SPACE, NVS_READWRITE) == ESP_OK) {
        auto ret = nvs_get_u32(nvs, NVS_KEY, reinterpret_cast<uint32_t*>(&sets)); //reinterpret_cast<uint32_t*>(&sets)
        if (ret == ESP_OK) {
            //if (crc8_le(0, (byte*)&sets, 3) == sets.crc) {
				ESP_LOGI(TAG, "Alarm %u, relay %u, proxima  %u, adc_line %u", 
					sets.alarm, sets.relay, sets.proxima, sets.adc_line);
	            //sets.alarm ? alarm_on(false) : alarm_off(false);
                return;
            //} else { ESP_LOGW(TAG, "sets.crc = 0x%02X", sets.crc); };
        } else { CHECK_(ret); }
    }
	sets.alarm = 1; sets.proxima = 1, sets.adc_line = 1;//alarm_on(false);
	nvs_write_sets(nvs);
}

void nvs_write_sets(nvsApi nvs) {
	//sets.crc = crc8_le(0, (byte*)&sets, 3); log_d("%u, %02X", sets.alarm, sets.crc);
    esp_err_t ret = nvs_set_u32(nvs, NVS_KEY, reinterpret_cast<uint32_t&>(sets));
	if(ret == ESP_OK) { ret = nvs_commit(nvs); return; };
    CHECK_(ret);
}

void get_task_list(String& str) {
	auto num = uxTaskGetNumberOfTasks(); log_d("GetNumberOfTasks = %u", num);
	if (!str.reserve(num * 35)) return;
	char* const ptr = str.begin();
	vTaskList(ptr);
	reinterpret_cast<uint32_t*>(&str)[2] = strlen(ptr);
}

String get_info(bool ver) {
	uint32_t heap = ESP.getFreeHeap(); uint32_t sec = uS / 1000000;
	String str; str.reserve(300);
	str += "Connected to: "; str += WiFi.SSID(); str += "\nLocal IP: "; str += WiFi.localIP().toString(); str += "\nRSSI: "; str += WiFi.RSSI();
	str += "\nFree Heap: "; str += heap; str += "\nStack watermark:"; str += "\nmain "; str += uxTaskGetStackHighWaterMark2(NULL);
	str += "\nsend "; str += uxTaskGetStackHighWaterMark2(sendTaskHandle);
#ifdef CONFIG_GENERIC_LINE
	str += "\nadc "; str += uxTaskGetStackHighWaterMark2(adcReadTaskHandle);
#endif
	//str += "\ninterrupt_delta =  "; str += interrupt_delta;
	str += "\nSettings 0x"; str += String(reinterpret_cast<uint32_t&>(sets), HEX);
	if(last_interrupt != 0xFFFFFF) { str += "\nlast_interrupt: "; str += last_interrupt; }
	str += "\nUptime: "; str += sec / 3600 / 24;  str += "d "; str += sec / 3600 % 24; str += "h "; str += sec / 60 % 60; str += "m "; str += sec % 60; str += "s";
	str += "\nUnix time: "; str += (timestamp_unix + ((uS - time_sync_unix) / 1000000ul));
	if (ver) {
		if (img_state(false) == ESP_OTA_IMG_PENDING_VERIFY) { str += "ESP_OTA_IMG_PENDING_VERIFY"; }
		str += ("\nCompiled: " __TIMESTAMP__ "\n");
	} log_d("%u", str.length());
	return str;
}

void init_sets() {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima && !timer_sab) { 
		assert(timer_sab = timer_init(TIMER_SABOTAGE, sabotage_timer));
		assert(timer_intr = esp_timer_init([](void*) { enableInterrupt(PIN_LINE); } ));
		attachInterrupt(PIN_LINE, &isr_handler, GPIO_INTR_NEGEDGE);
	} else if(!sets.proxima && timer_sab){ 
		detachInterrupt(PIN_LINE);
		CHECK_(esp_timer_delete(timer_intr));
		CHECK_(gptimer_stop(timer_sab));
		CHECK_(gptimer_disable(timer_sab));
		CHECK_(gptimer_del_timer(timer_sab)); 
		timer_sab = NULL;
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line && !adc_handle) {
		adc_channel_t channel[] = { PIN_ADC_LINE }; int size = sizeof(channel)/sizeof(adc_channel_t);
		assert(adc_handle = continuous_adc_init(conv_done_cb, channel, size, BUF_ADC_SIZE)); 
		//ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
		vTaskResume(adcReadTaskHandle);
	}
	else if (!sets.adc_line && adc_handle) {
		vTaskSuspend(adcReadTaskHandle);
		CHECK_(adc_continuous_stop(adc_handle)); 
		CHECK_(adc_continuous_deinit(adc_handle));
		adc_handle = NULL;
	}
#endif
}

void alarm_on(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) {  enableInterrupt(PIN_LINE); timer_start_impl(); ESP_LOGI(TAG, "ALARM_ON"); }
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 1;
	if (write) {  nvs_write_sets(); } 
#endif
}

void alarm_off(bool write) {
#ifdef CONFIG_PROXIMA_PIR
	if(sets.proxima) { 
		disableInterrupt(PIN_LINE); timer_stop_impl();  ESP_LOGI(TAG, "ALARM_OFF");
	}
#endif
#ifdef CONFIG_GENERIC_LINE
	if(sets.adc_line) { /* nothing */  } else {/* nothing */ }
#endif
#if defined CONFIG_GENERIC_LINE || defined CONFIG_GENERIC_LINE
	sets.alarm = 0;
	if (write) {  nvs_write_sets(); } 
#endif
}

void create_hex_string(String& str, cbyte* buf, cbyte data_size) {
	const size_t str_size = data_size * 3;
	if (!str.reserve(str_size)) return; //log_d("%u", str.isSSO());
	char* ptr = str.begin(); if(!ptr) { log_d("NULL"); return; }
	byte *field = reinterpret_cast<byte*>(&str) + (sizeof(String) -1); static_assert(sizeof(String) == 16);
	if(*field & 0x80) { *field = (str_size | 0x80); }// SSO
	else reinterpret_cast<uint32_t*>(&str)[2] = str_size;
	for (byte i = 0, shift, nibble, num;;*ptr++ = ' ') {
		for (shift = 4, num = buf[i];; shift = 0) {
			nibble = (num >> shift) & 0xF;
			*ptr++ = nibble < 10 ? nibble ^ 0x30 : nibble + ('A' - 10);
			if (shift == 0) break;
		} 
		if (++i >= data_size) break;
	}*ptr = '\0';
	log_d("str.length: %u, data_size: %u", str.length(), data_size);
}

